question_gen/app/Http/Controllers/GenerateQuestionController.php

    public function index(){
        $datas = GenerateQuestion::get();
---
select * from `generate_question`

    public function store(Request $request){
        $input = $request->only(['class', 'status','marks','ques_limit','subject','ques_type','exam_time','instructions']);

        $validate_data = [
            'class' => 'required',
            'status' => 'required',
            'marks' => 'required|min:2',
            'ques_limit' => 'required',
            'subject' => 'required',
            'ques_type' => 'required',
            'exam_time' => 'required',
            'instructions' => 'required',
        ];

        $validator = Validator::make($input, $validate_data);

        if ($validator->fails()) {
            return response()->json([
                'success' => false,
                'message' => 'Please see errors parameter for all errors.',
                'errors' => $validator->errors()
            ]);
        }

        $sub = Subject::where('name',$input['subject']);
        if($sub->count() > 0){
            $sub = $sub->first();
            $input['subject'] = $sub->id;
        }

        $question = Question::where(['ques_type'=>$input['ques_type'],'subject'=> $input['subject'],'class'=>$input['class'],'status'=>$input['status']])->limit($input['ques_limit'])->inRandomOrder()->get();
---
select count(*) as aggregate from `subject` where `name` = 'BANGLA'
select * from `subject` where `name` = 'BANGLA' limit 1
select * from `questions` where (`ques_type` = '1' and `subject` = 1 and `class` = '1' and `status` = '2') order by RAND() limit 1

            array_push($ques_ids, $qus->id);
        }
        $input['ques_ids'] = json_encode($ques_ids);
        $datas = GenerateQuestion::create($input);
---
insert into `generate_question` (`class`, `status`, `marks`, `ques_limit`, `subject`, `ques_type`, `exam_time`, `instructions`, `ques_ids`, `updated_at`, `created_at`) values ('1', '2', '100', '1', 1, '1', '30', 'Lorem ipsum dollar text', '[9]', '2022-06-30 20:37:23', '2022-06-30 20:37:23')

    public function update(Request $request,$id){

        $input = $request->only(['class', 'status','marks','ques_limit','subject','ques_type','exam_time','instructions']);

        $validate_data = [
            'class' => 'required',
            'status' => 'required',
            'marks' => 'required|min:2',
            'ques_limit' => 'required',
            'subject' => 'required',
            'ques_type' => 'required',
            'exam_time' => 'required',
            'instructions' => 'required',
        ];

        $validator = Validator::make($input, $validate_data);

        if ($validator->fails()) {
            return response()->json([
                'success' => false,
                'message' => 'Please see errors parameter for all errors.',
                'errors' => $validator->errors()
            ]);
        }

        $sub = Subject::where('name',$input['subject']);
        if($sub->count() > 0){
            $sub = $sub->first();
            $input['subject'] = $sub->id;
        }

        $question = Question::where(['ques_type'=>$input['ques_type'],'subject'=> $input['subject'],'class'=>$input['class'],'status'=>$input['status']])->limit($input['ques_limit'])->inRandomOrder()->get();
---
select count(*) as aggregate from `subject` where `name` = 'BANGLA'
select * from `subject` where `name` = 'BANGLA' limit 1
select * from `questions` where (`ques_type` = '1' and `subject` = 1 and `class` = '1' and `status` = '2') order by RAND() limit 2

            array_push($ques_ids, $qus->id);
        }
        $input['ques_ids'] = json_encode($ques_ids);
        GenerateQuestion::where('id',$id)->update($input);
        $datas = GenerateQuestion::where('id',$id)->first();
---
update `generate_question` set `class` = '1', `status` = '2', `marks` = '100', `ques_limit` = '2', `subject` = 1, `ques_type` = '1', `exam_time` = '30', `instructions` = 'Lorem ipsum dollar text', `ques_ids` = '[9,10]', `generate_question`.`updated_at` = '2022-06-30 20:46:04' where `id` = '1'
select * from `generate_question` where `id` = '1' limit 1

    public function show($id){
        $datas = GenerateQuestion::where('id',$id);
        if($datas->count() == 0)
        {
            return response()->json([
                'success'=>false,
                'message'=> "NO DATA FOUND"
            ]);
        }
        return response()->json([
            'success'=>true,
            'data' => $datas->first()
---
select count(*) as aggregate from `generate_question` where `id` = '1'
select * from `generate_question` where `id` = '1' limit 1

    public function destroy($id){
        $datas = GenerateQuestion::where('id',$id);
        if($datas->count() == 0)
        {
            return response()->json([
                'success'=>false,
                'message'=> "NO DATA FOUND"
            ]);
        }
        $datas->delete();
---
select count(*) as aggregate from `generate_question` where `id` = '1'
delete from `generate_question` where `id` = '1'