question_gen/app/Http/Controllers/QuestionController.php

    public function destroy( $id)
    {
        $question = Question::where("id",$id);
        if($question->count() > 0){
            $question = $question->first();
            $question->answer()->delete();
---
select count(*) as aggregate from `questions` where `id` = '8'
delete from `questions` where `id` = 8