question_gen/app/Http/Controllers/QuestionController.php

select * from `board` where `board`.`id` in (6)
select * from `class` where `class`.`id` in (1)
select * from `institute` where `institute`.`id` in (3)
select * from `questions`
---
    public function index()
    {
        $qus = Question::with(['options','answer','class','institute','board','ques_year','subject'])->get();

select * from `institute` where `name` = 'DHAKA TECHNICAL COLLEGE' limit 1
select count(*) as aggregate from `institute` where `name` = 'DHAKA TECHNICAL COLLEGE'
insert into `institute` (`name`, `updated_at`, `created_at`) values ('DHAKA TECHNICAL COLLEGE', '2022-06-29 21:30:49', '2022-06-29 21:30:49')
select count(*) as aggregate from `subject` where `name` = 'Bangla'
select * from `subject` where `name` = 'Bangla' limit 1
---
    public function store(Request $request)
    {
        $input = $request->only(['ques_type', 'question','subject','status','class','institute','board','ques_year']);

        $validate_data = [
            'ques_type' => 'required',
            'question' => 'required|min:3',
            'subject' => 'required|min:3',
            'status' => 'required',
            'class' => 'required',
            'institute' => 'required',
            'board' => 'required',
            'ques_year' => 'required',
        ];

        $validator = Validator::make($input, $validate_data);

        if ($validator->fails()) {
            return response()->json([
                'success' => false,
                'message' => 'Please see errors parameter for all errors.',
                'errors' => $validator->errors()
            ]);
        }
        $ins = Institute::where('name',$input['institute']);
        if($ins->count() > 0){
            $ins = $ins->first();
            $input['institute'] = $ins->id;
        }else{
            $ins = Institute::create(['name'=>$input['institute']]);
            $input['institute'] = $ins->id;
        }
        $sub = Subject::where('name',$input['subject']);
        if($sub->count() > 0){
            $sub = $sub->first();

insert into `questions` (`ques_type`, `question`, `subject`, `status`, `class`, `institute`, `board`, `ques_year`, `updated_at`, `created_at`) values ('1', 'Test 3', 1, '1', '1', 3, '6', '1', '2022-06-30 20:23:42', '2022-06-30 20:23:42')
insert into `question_options` (`name`, `qus_id`, `updated_at`, `created_at`) values ('opt1', 11, '2022-06-30 20:23:42', '2022-06-30 20:23:42')
insert into `question_answers` (`name`, `qus_id`, `updated_at`, `created_at`) values ('ans1', 11, '2022-06-30 20:23:42', '2022-06-30 20:23:42')
select * from `board` where `board`.`id` in (6)
select * from `class` where `class`.`id` in (1)
select * from `institute` where `institute`.`id` in (3)
select * from `questions` where `id` = 11 limit 1
---
            $sub = Subject::create(['name'=>$input['subject']]);
            $input['subject'] = $sub->id;
        }
        $ques = Question::create($input);

        $options =$request->options;
        for($i=0;$i<count($options);$i++){
            QuestionOption::create(['name'=>$options[$i],'qus_id'=>$ques->id]);
        }
        $answer =$request->answer;
        for($i=0;$i<count($answer);$i++){
            QuestionAnswer::create(['name'=>$answer[$i],'qus_id'=>$ques->id]);
        }

        $qus = Question::with(['options','answer','class','institute','board','ques_year','subject'])->where('id',$ques->id)->first();

select count(*) as aggregate from `questions` where `id` = '9'
select * from `board` where `board`.`id` in (6)
select * from `class` where `class`.`id` in (1)
select * from `institute` where `institute`.`id` in (3)
select * from `questions` where `id` = '9' limit 1
---
    public function show($id)
    {
        $question = Question::with(['options','answer','class','institute','board','ques_year','subject'])->where("id",$id);
        if($question->count() > 0){
            $question = $question->first();

select * from `questions` where `id` = '9' limit 1
select count(*) as aggregate from `institute` where `name` = 'DHAKA TECHNICAL COLLEGE'
select * from `institute` where `name` = 'DHAKA TECHNICAL COLLEGE' limit 1
---
    public function update(Request $request, $id)
    {
        $question = Question::where('id',$id)->first();
        $input = $request->only(['ques_type', 'question','subject','status','class','institute','board','ques_year']);

        $validate_data = [
            'ques_type' => 'required',
            'question' => 'required|min:3',
            'subject' => 'required|min:3',
            'status' => 'required',
            'class' => 'required',
            'institute' => 'required',
            'board' => 'required',
            'ques_year' => 'required',
        ];

        $validator = Validator::make($input, $validate_data);

        if ($validator->fails()) {
            return response()->json([
                'success' => false,
                'message' => 'Please see errors parameter for all errors.',
                'errors' => $validator->errors()
            ]);
        }
        $ins = Institute::where('name',$input['institute']);
        if($ins->count() > 0){
            $ins = $ins->first();

select count(*) as aggregate from `subject` where `name` = 'Bangla'
select * from `subject` where `name` = 'Bangla' limit 1
---
            $input['institute'] = $ins->id;
        }
        $sub = Subject::where('name',$input['subject']);
        if($sub->count() > 0){
            $sub = $sub->first();

update `questions` set `ques_type` = '1', `question` = 'Test', `subject` = 1, `status` = '1', `class` = '1', `institute` = 3, `board` = '6', `ques_year` = '1', `questions`.`updated_at` = '2022-06-30 19:58:39' where `id` = '9'
---
            $input['subject'] = $sub->id;
        }

        Question::where('id',$id)->update($input);

insert into `question_options` (`name`, `qus_id`, `updated_at`, `created_at`) values ('opt1', 9, '2022-06-30 19:58:39', '2022-06-30 19:58:39')
insert into `question_answers` (`name`, `qus_id`, `updated_at`, `created_at`) values ('ans1', 9, '2022-06-30 19:58:39', '2022-06-30 19:58:39')
select * from `board` where `board`.`id` in (6)
select * from `class` where `class`.`id` in (1)
select * from `institute` where `institute`.`id` in (3)
select * from `questions` where `id` = 9 limit 1
---

        $options =$request->options;
        for($i=0;$i<count($options);$i++){
            QuestionOption::create(['name'=>$options[$i],'qus_id'=>$question->id]);
        }
        $answer =$request->answer;
        for($i=0;$i<count($answer);$i++){
            QuestionAnswer::create(['name'=>$answer[$i],'qus_id'=>$question->id]);
        }

        $qus = Question::with(['options','answer','class','institute','board','ques_year','subject'])->where('id',$question->id)->first();